In [12]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (9.3.0)

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [13]:
!pip install pandas matplotlib seaborn

Requirement already satisfied: pandas in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (2.3.0)
Requirement already satisfied: matplotlib in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (3.10.3)
Requirement already satisfied: seaborn in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (0.13.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (1.3.2)
Requirement already satisfied: cycler>=0.10 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (4.58.4)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (1.4.8)
Requirement already satisfied: packaging>=20.0 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (25.0)
Requirement already satisfied: pillow>=8 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (11.2.1)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (3.2.3)
Requirement already satisfied: six>=1.5 in c:\users\ingri\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [14]:
import mysql.connector

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [95]:
try:
    conexion = mysql.connector.connect(
        host='212.227.90.6',
        user='Equipo16',
        password='E1q2u3i4p5o16',
        database='Equip_16')

    cursor = conexion.cursor()
    print("✅ Conexión exitosa a la base de datos.")

    # Función para cargar tablas
    def cargar_tabla(nombre_tabla):
        cursor.execute(f"SELECT * FROM {nombre_tabla}")
        return pd.DataFrame(cursor.fetchall(), columns=[col[0] for col in cursor.description])

    # Cargar tablas
    df_bank = cargar_tabla("BANK_marketing22092025")

    cursor.close()
    conexion.close()

except mysql.connector.Error as err:
    print(f"❌ Error de conexión a la base de datos: {err}")

# Guardar CSV correctamente
df_bank.to_csv(r"D:\Trabajo\Especializacion DATA - BA\Salva\dataset_23092025.csv", index=False)
print("✅ CSV guardado correctamente.")

✅ Conexión exitosa a la base de datos.
✅ CSV guardado correctamente.

Ino general del dataset

In [96]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16172 entries, 0 to 16171
Data columns (total 18 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         16172 non-null  int64
 1   age        16155 non-null  float64
 2   job        16172 non-null  object
 3   marital    16165 non-null  object
 4   education  16164 non-null  object
 5   default    16172 non-null  object
 6   balance    16172 non-null  int64
 7   housing    16152 non-null  object
 8   loan       16172 non-null  object
 9   contact    16172 non-null  object
 10  day        16172 non-null  int64
 11  month      16172 non-null  object
 12  duration   16172 non-null  int64
 13  campaign   16172 non-null  int64
 14  pdays      16172 non-null  int64
 15  previous   16172 non-null  int64
 16  poutcome   16172 non-null  object
 17  deposit    16172 non-null  object
dtypes: float64(1), int64(7), object(10)
memory usage: 2.2+ MB

In [97]:
df_bank.describe()

,id,age,balance,day,duration,campaign,pdays,previous
count,16172.000000,16155.00000,16172.000000,16172.000000,16172.000000,16172.000000,16172.000000,16172.000000
mean,9699.646302,41.22086,1508.458632,15.657062,374.053178,2.507791,51.800952,0.838115
std,6755.278621,11.93722,3164.045641,8.419686,348.977261,2.703518,109.819968,2.326407
min,1.000000,18.00000,-6847.000000,1.000000,2.000000,1.000000,-1.000000,0.000000
25%,4042.750000,32.00000,121.000000,8.000000,138.000000,1.000000,-1.000000,0.000000
50%,8083.500000,39.00000,544.000000,15.000000,256.000000,2.000000,-1.000000,0.000000
75%,17346.250000,49.00000,1697.000000,22.000000,500.250000,3.000000,33.000000,1.000000
max,21383.000000,95.00000,81204.000000,31.000000,3881.000000,63.000000,854.000000,58.000000

In [98]:
# Resumen de variables categóricas
df_bank.describe(include=['object'])

,job,marital,education,default,housing,loan,contact,month,poutcome,deposit
count,16172,16165,16164,16172,16152,16172,16172,16172,16172,16172
unique,12,3,4,2,2,2,3,12,4,2
top,management,married,secondary,no,no,no,cellular,may,unknown,no
freq,3731,9191,7913,15931,8542,14053,11685,4076,12048,8470

In [99]:
# Ver IDs duplicados
df_duplicados = df_bank[df_bank.duplicated(subset='id', keep=False)]
df_duplicados

,id,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,deposit
1610,1611,32.0,management,single,tertiary,no,2069,no,no,cellular,22,apr,545,1,-1,0,unknown,yes
6814,6815,28.0,student,single,secondary,no,28,no,no,cellular,29,jan,220,2,-1,0,unknown,no
6911,6912,39.0,housemaid,married,primary,no,267,no,no,unknown,9,jun,1151,5,-1,0,unknown,no
11390,16612,34.0,services,single,secondary,no,-374,yes,no,cellular,11,may,672,1,-1,0,unknown,yes
12393,17615,28.0,management,married,tertiary,no,22,yes,no,cellular,31,jul,59,3,-1,0,unknown,no
12984,18206,36.0,blue-collar,single,secondary,no,2235,yes,no,cellular,20,nov,287,2,-1,0,unknown,no
13550,18772,27.0,admin.,married,tertiary,no,346,no,no,cellular,11,oct,212,1,-1,0,unknown,yes
13698,18920,60.0,retired,married,primary,no,600,no,no,cellular,19,aug,99,6,-1,0,unknown,no
14227,19449,68.0,retired,divorced,primary,no,476,no,no,telephone,28,jun,363,1,-1,0,unknown,yes
14343,19565,63.0,retired,married,tertiary,no,1795,no,no,cellular,7,sep,219,1,-1,0,unknown,yes
16162,6815,28.0,student,single,secondary,no,28,no,no,cellular,29,jan,220,2,-1,0,unknown,no
16163,18772,27.0,admin.,married,tertiary,no,346,no,no,cellular,11,oct,212,1,-1,0,unknown,yes
16164,16612,34.0,services,single,secondary,no,-374,yes,no,cellular,11,may,672,1,-1,0,unknown,yes
16165,18920,60.0,retired,married,primary,no,600,no,no,cellular,19,aug,99,6,-1,0,unknown,no
16166,1611,32.0,management,single,tertiary,no,2069,no,no,cellular,22,apr,545,1,-1,0,unknown,yes
16167,18206,36.0,blue-collar,single,secondary,no,2235,yes,no,cellular,20,nov,287,2,-1,0,unknown,no
16168,17615,28.0,management,married,tertiary,no,22,yes,no,cellular,31,jul,59,3,-1,0,unknown,no
16169,19449,68.0,retired,divorced,primary,no,476,no,no,telephone,28,jun,363,1,-1,0,unknown,yes
16170,19565,63.0,retired,married,tertiary,no,1795,no,no,cellular,7,sep,219,1,-1,0,unknown,yes
16171,6912,39.0,housemaid,married,primary,no,267,no,no,unknown,9,jun,1151,5,-1,0,unknown,no

In [100]:
df_bank = df_bank.drop_duplicates(subset='id', keep='first')
df_bank.duplicated(subset='id').sum() # debe dar 0

np.int64(0)

In [103]:
# Seleccionar columnas relevantes
df = df_bank[['id', 'balance', 'loan', 'housing', 'default']].copy()

# Convertir a minúsculas y quitar espacios
df['loan'] = df['loan'].str.strip().str.lower()
df['housing'] = df['housing'].str.strip().str.lower()
df['default'] = df['default'].str.strip().str.lower()

# Mapear a 1/0
df['default'] = df['default'].map({'yes': 1, 'no': 0})
df['loan'] = df['loan'].map({'yes': 1, 'no': 0})
df['housing'] = df['housing'].map({'yes': 1, 'no': 0})
df['housing'] = df['housing'].fillna(2)

df.describe()

                 id       balance          loan       housing       default
count  16162.000000  16162.000000  16162.000000  16162.000000  16162.000000
mean    9696.708514   1508.930145      0.131110      0.473147      0.014912
std     6754.510024   3164.890905      0.337531      0.501766      0.121203
min        1.000000  -6847.000000      0.000000      0.000000      0.000000
25%     4041.250000    121.000000      0.000000      0.000000      0.000000
50%     8081.500000    544.000000      0.000000      0.000000      0.000000
75%    17342.750000   1697.000000      0.000000      1.000000      0.000000
max    21383.000000  81204.000000      1.000000      2.000000      1.000000

In [105]:
housing_vacios = df[df['housing'] == 2]
housing_vacios

          id  balance  loan  housing  default
52        53     1521     1      2.0        0
1331    1332      409     0      2.0        0
1367    1368     2786     0      2.0        0
1430    1431      423     0      2.0        0
1441    1442      803     0      2.0        0
2430    2431      153     0      2.0        0
2819    2820     5878     0      2.0        0
3032    3033     2074     0      2.0        0
3208    3209      846     0      2.0        0
3423    3424     -115     0      2.0        0
5453    5454        0     0      2.0        0
7540    7541     1708     0      2.0        0
8487    8488       21     1      2.0        0
9952    9953     3164     0      2.0        0
11189  16411      113     0      2.0        0
11940  17162      594     0      2.0        0
13005  18227      390     0      2.0        0
13229  18451       32     0      2.0        0
13842  19064     1844     0      2.0        0
14123  19345      338     0      2.0        0

In [111]:
# Crear grupos combinando loan y housing
df['grupo'] = df['loan'].astype(str) + df['housing'].astype(str)

# Mapear nombres descriptivos
nombre_grupo = {
    '00': 'Sin préstamo / Sin vivienda',
    '01': 'Sin préstamo / Con vivienda',
    '10': 'Con préstamo / Sin vivienda',
    '11': 'Con préstamo / Con vivienda'
}

df['nombre_grupo'] = df['grupo'].map(nombre_grupo)

In [92]:
# Crear columna de grupos combinando loan y housing
df['grupo'] = df['loan'].astype(str) + df['housing'].astype(str)

# Calcular saldo medio y tasa de incumplimiento por grupo
resumen = df.groupby('grupo').agg(
    Saldo_Medio=('balance', 'mean'),
    Tasa_Incumplimiento=('default', 'mean')
).reset_index()

# Redondear tasas a porcentajes más legibles
resumen['Tasa_Incumplimiento'] = resumen['Tasa_Incumplimiento'] * 100
resumen['Saldo_Medio'] = resumen['Saldo_Medio'].round(2)
resumen['Tasa_Incumplimiento'] = resumen['Tasa_Incumplimiento'].round(2)

print(resumen)

  grupo  Saldo_Medio  Tasa_Incumplimiento
0    02      1191.11                 0.00
1   0no      1853.02                 0.83
2  0yes      1327.35                 1.45
3    12       771.00                 0.00
4   1no       898.34                 5.04
5  1yes       765.31                 3.24